src/Python/flycheck-pylint-emacs-with-python.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: Python with flycheck + pylint in emacs
#+OPTIONS: num:nil H:2

* flycheck and pylint
Pylint use [[https://www.python.org/dev/peps/pep-0008/][Python's PEP8 style]] to format the python code. And with h
the Flycheck emacs extension, pylint’s output will be shown right
inside your emacs buffers. 

*Requirements:*
+ emacs version 24 or newer.

* install flycheck and pylint
#+begin_src sh
sudo apt-get install pylint
# use emacs’ package manager install it
M-x package-install RET flycheck
#+end_src

* configure emacs
#+begin_src emacs-lisp
  (defun flycheck-python-setup ()
    (flycheck-mode))
  (add-hook 'python-mode-hook #'flycheck-python-setup)
#+end_src

* configure pylint
#+begin_src sh
pylint --generate-rcfile >.pylintrc
#+end_src

Disable whatever warnings and errors you want by adding the
appropriate codes to the “disable=” line in your =.pylintrc= file.
Full list is [[http://pylint-messages.wikidot.com/all-messages][here]].

Examples:

#+begin_src text
disable= C0326, W0621, C0111, C0103, W0702, W0703, C0321, W0511, W0102, R0913,
         R0914, R0915, R0912, R0902, R0903, C0303, C0302, C0325, W0401
#+end_src
