public_html/Python/flycheck-pylint-emacs-with-python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Python with flycheck + pylint in emacs</title>
<!-- 2014-12-11 Thu 21:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Python with flycheck + pylint in emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">flycheck and pylint</a></li>
<li><a href="#sec-2">install flycheck and pylint</a></li>
<li><a href="#sec-3">configure emacs</a></li>
<li><a href="#sec-4">configure pylint</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">flycheck and pylint</h2>
<div class="outline-text-2" id="text-1">
<p>
Pylint use <a href="https://www.python.org/dev/peps/pep-0008/">Python's PEP8 style</a> to format the python code. And with h
the Flycheck emacs extension, pylint’s output will be shown right
inside your emacs buffers. 
</p>

<p>
<b>Requirements:</b>
</p>
<ul class="org-ul">
<li>emacs version 24 or newer.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">install flycheck and pylint</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install pylint
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">use emacs&#8217; package manager install it</span>
M-x package-install RET flycheck
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">configure emacs</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">flycheck-python-setup</span> ()
  (flycheck-mode))
(add-hook 'python-mode-hook #'flycheck-python-setup)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">configure pylint</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-sh">pylint --generate-rcfile &gt;.pylintrc
</pre>
</div>

<p>
Disable whatever warnings and errors you want by adding the
appropriate codes to the “disable=” line in your <code>.pylintrc</code> file.
Full list is <a href="http://pylint-messages.wikidot.com/all-messages">here</a>.
</p>

<p>
Examples:
</p>

<div class="org-src-container">

<pre class="src src-text">disable= C0326, W0621, C0111, C0103, W0702, W0703, C0321, W0511, W0102, R0913,
         R0914, R0915, R0912, R0902, R0903, C0303, C0302, C0325, W0401
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-12-11 Thu 21:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
